app/controllers/api/v1/posts_controller.rb

  def index
    @posts = Post.all
---
SELECT "posts".* FROM "posts"

  def show
    @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create
    @post = Post.new(post_params)
    if @post.save
---
INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["title", "はじめての投稿"], ["content", "はじめての投稿"], ["created_at", "2024-12-01 14:45:49.459350"], ["updated_at", "2024-12-01 14:45:49.459350"]]

  def update
    @post = Post.find(params[:id])
    if @post.update(post_params)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "１回目修正"], ["content", "１回目"], ["updated_at", "2024-12-04 13:18:57.711907"], ["id", 1]]

  def destroy
    @post = Post.find(params[:id])
    @post.destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 2]]