app/controllers/api/v1/posts_controller.rb

  def update
    @post = Post.find(params[:id])
    if @post.update(post_params)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "１回目修正"], ["content", "１回目"], ["updated_at", "2024-12-04 13:18:57.711907"], ["id", 1]]